# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Collection of portable C++ source libraries
brew "boost"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Open-source framework for augmenting humans using AI
brew "fabric-ai"
# Data validation using Python type hints
brew "pydantic"
# CLI for FastAPI framework
brew "fastapi"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Lint your Python code for style and logical errors
brew "flake8"
# Lightweight scripting language for querying databases
brew "flux"
# Generic library support script
brew "libtool"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Asynchronous event library
brew "libevent"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Colorize logfiles and command output
brew "grc"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Checks presence of various command-line tools and their versions on the path
brew "has"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Small build system for use with gyp or CMake
brew "ninja"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Object file converter
brew "objconv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Lightweight connection pooler for PostgreSQL
brew "pgbouncer", restart_service: :changed
# Object-relational database system
brew "postgresql@15"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# Simple powerful testing with Python
brew "pytest"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Safe, concurrent, practical language
brew "rust"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Cross-shell prompt for astronauts
brew "starship"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Generator for LS_COLORS with support for multiple color themes
brew "vivid"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# GPU-accelerated terminal emulator
cask "alacritty"
# Tool to run Windows software
cask "crossover"
cask "font-hack-nerd-font"
# Font editor and converter for outline and bitmap fonts
cask "fontforge-app"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
cargo "eza"
uv "zettelkasten-cli"
